
movies_dict = {
    "Лед 3": {
        "дата": "2023-12-01",
        "время": "12:00",
        "количество свободных мест": 100,
        "цена за билет": 300
    },
    "Гарри Потер 4": {
        "дата": "2023-13-02",
        "время": "14:00",
        "количество свободных мест": 50,
        "цена за билет": 200
    },
    "Смешарики": {
        "дата": "2023-27-03",
        "время": "14:00",
        "количество свободных мест": 40,
        "цена за билет": 250
    },
    "Тачки 3": {
        "дата": "2023-19-04",
        "время": "14:00",
        "количество свободных мест": 80,
        "цена за билет": 1000
    },
    "Желтый глаз тигра": {
        "дата": "2023-11-05",
        "время": "14:00",
        "количество свободных мест": 63,
        "цена за билет": 500
    },
    "Гарри Потер 3": {
        "дата": "2023-22-06",
        "время": "14:00",
        "количество свободных мест": 150,
        "цена за билет": 150
    },
    "Фиксики": {
        "дата": "2023-09-07",
        "время": "14:00",
        "количество свободных мест": 1000,
        "цена за билет": 50
    },
    "Терминатор": {
        "дата": "2023-16-08",
        "время": "14:00",
        "количество свободных мест": 4,
        "цена за билет": 530
    },
    "Вызов": {
        "дата": "2023-27-09",
        "время": "14:00",
        "количество свободных мест": 20,
        "цена за билет": 666
    },
    "Лед": {
        "дата": "2023-22-11",
        "время": "14:00",
        "количество свободных мест": 77,
        "цена за билет": 946
    },
}


def get_movie_info(movie_name):
    movie_info = movies_dict.get(movie_name)
    if movie_info is None:
        print("Извините, но мы не нашли информацию о фильме '{}'".format(movie_name))
        print("Пожалуйста, введите название фильма заново.")
        return None
    else:
        print("Информация о фильме '{}':".format(movie_name))
        for key, value in movie_info.items():
            print("{}: {}".format(key, value))
        return movie_info

get_movie_info(input("Введите название фильма: "))