" для ЕГЭ по информатике"
# перевод из двоичной в десятичную 

int("11111111",2)

# перевод из десятичной в двоичный 

bin(100)

# Аналогичная функция есть 
# для преобразования в шестнадцатеричный формат:

hex(10)

# функция set 

# Функция set преобразует аргумент в множество:
# Эта функция очень полезна, когда нужно
# получить уникальные элементы в последовательности

set((1,2,2,2,2,2,2,5,-1,59,34,97))

# функция tuple 

# Функция tuple преобразует аргумент в кортеж:
# Это может пригодиться в том случае, 
# если нужно получить неизменяемый объект.

tuple({1,2,2,5,5,57,8,664})
